---自动生成的 不要手动编辑---
---@type kx_shops_data[]
local _kx_shops_table = 
{
[1] = {idx = 1,title = 'Potion',commoditys = {'小型魔法药瓶','小型生命血瓶','中型魔法药瓶','中型生命血瓶','大型魔法药瓶','大型生命血瓶','混合药瓶','超大型魔法药瓶','超大型生命血瓶','巨型魔法药瓶','巨型生命血瓶','清澈药水','究极药水','超清澈药水','超究极药水',}, },
[2] = {idx = 2,title = 'Etc',commoditys = {'移动卷轴','高级回城卷轴','鹰眼卷轴','超级回城卷轴','提速卷轴','攻击速度卷轴','三级箭筒','超级传声筒',}, },
[3] = {idx = 3,title = 'Etc',commoditys = {'干鱼片','蘑菇','彩虹草','宝石粉末','妖精粉末','生命之水',}, },
[4] = {idx = 4,title = 'Shield',commoditys = {'巡逻护体','小圆盾','木盾','全钢护体','龟甲盾','十字护体','幻之盾','冰蓝护体','星钢盾','紫电护体','炫彩盾','玫瑰护体','六星护体','红十字盾','战争盾','猎豹护体','骑士盾','雷牙护体','勇者之盾','真红护体','魔龙之盾','百烈护体','游侠之盾','黄金护体','撒旦之盾','兽王护体','罗塔盾','狂雷护体','封魔盾','蓝牙护体','斗神之盾','镇魂护体','冥王盾','火云护体',}, },
[5] = {idx = 5,title = 'Warrior',commoditys = {'轻型铠','白银甲','疾风战甲','英雄铠','重装铠甲','战神宝铠',}, },
[6] = {idx = 6,title = 'Warrior',commoditys = {'防身护腿','青铜之护腿','白金护腿','骑士之护腿','荣誉之护腿','勇者之护腿','祝福之护腿','力量之护腿','辉煌之护腿','梵天战护腿',}, },
[7] = {idx = 7,title = 'Warrior',commoditys = {'防身护臂','青铜护臂','白金护臂','骑士护臂','荣誉护臂','寒冰护臂','勇者护臂','祝福护臂','力量护臂','辉煌护臂','英雄护臂',}, },
[8] = {idx = 8,title = 'Warrior',commoditys = {'防身头盔','青铜之盔','白金头盔','骑士之盔','荣誉头盔','寒冰头盔','勇者之盔','祝福头盔','力量头盔','辉煌头盔','英雄头盔',}, },
[9] = {idx = 9,title = 'OHWarrior',commoditys = {'防身刀','铁剑','赤铜剑','青钢剑','冰霜刃','冷月刀','赤炼斩','真空刺刃','妖刀','空牙双蛇剑','风间苍月刀','勇者之剑','爱肯剑','炼狱炎龙剑','破魔天罡剑',}, },
[10] = {idx = 10,title = 'Fighter',commoditys = {'防身拳套','钉刺拳套','臂刃','玄电爪','弯月钩','鹰嘴','虎颚','刺臂','毒牙','百川流水刃','天狼爪','新月','夜叉','凰翼',}, },
[11] = {idx = 11,title = 'Magician',commoditys = {'学徒袍','信徒袍','红莲法袍','星印法袍','雷火神衣','火纹圣衣',}, },
[12] = {idx = 12,title = 'Magician',commoditys = {'学徒护腿','信徒护腿','进阶护腿','黄金护腿','神秘护腿','光明之护腿','混乱之护腿','精灵之护腿','圣者之护腿','智慧之护腿','翡翠之护腿',}, },
[13] = {idx = 13,title = 'Magician',commoditys = {'学徒护臂','信徒护臂','专注护臂','黄金护臂','神秘护臂','光明护臂','混乱护臂','精灵护臂','圣者护臂','智慧护臂','翡翠护臂',}, },
[14] = {idx = 14,title = 'Magician',commoditys = {'学徒帽','信徒帽','专注之帽','黄金帽','神秘头盔','光明之帽','混乱之帽','精灵之帽','圣者之帽','智慧之帽','翡翠之帽',}, },
[15] = {idx = 15,title = 'Magician',commoditys = {'学徒杖','幸运之杖','荣誉之杖','魔力之杖','胜利之杖','火魂之杖','光明法杖','邪眼法杖','道德法杖','龙骨法杖','星光法杖','天使法杖','雷霆神杖','诅咒之杖',}, },
[16] = {idx = 16,title = 'Magician',commoditys = {'卑下之服','命令之服','骄傲之服','神之服','精神之服','优雅之服',}, },
[17] = {idx = 17,title = 'Magician',commoditys = {'卑下之护腿','新手护腿','命令之护腿','冲锋护腿','骄傲之护腿','敬意之护腿','神之护腿','礼拜者之护腿','精神之护腿','灵魂之护腿','优雅之护腿',}, },
[18] = {idx = 18,title = 'Magician',commoditys = {'卑下之护腕','新手护腕','命令之护腕','冲锋护腕','骄傲之护腕','敬意之护腕','神之护腕','礼拜者之护腕','精神之护臂','灵魂护腕','优雅之护腕',}, },
[19] = {idx = 19,title = 'Magician',commoditys = {'卑下之帽','新手帽','命令之帽','冲锋帽','骄傲之帽','敬意之帽','神之帽','礼拜者之帽','精神之帽','灵魂之帽','优雅之帽',}, },
[20] = {idx = 20,title = 'Magician',commoditys = {'精灵之杖','强化之杖','自然之杖','混沌之杖','守护者之杖','梦幻之杖','耐力之杖','秩序之杖','死亡之杖','寂静之杖','狂野之杖','毁灭之杖','智慧之杖','仙羽之杖',}, },
[21] = {idx = 21,title = 'Archer',commoditys = {'起始之服','创始之服','友情之服','远古服','生存之服','欲望之服',}, },
[22] = {idx = 22,title = 'Archer',commoditys = {'起始之护腿','熟练之护腿','创始之护腿','箭术之护腿','友情之护腿','爵士之护腿','寒冰护腿','起源之护腿','生存之护腿','延续之护腿','欲望之护腿',}, },
[23] = {idx = 23,title = 'Archer',commoditys = {'起始护腕','熟练之护腕','创始护腕','箭术护腕','友情护腕','爵士护腕','寒冰护腕','起源之护腕','生存之护腕','延续护腕','欲望护腕',}, },
[24] = {idx = 24,title = 'Archer',commoditys = {'起始之帽','熟练之帽','创始之帽','射手帽','友情之帽','爵士之帽','远古帽','起源之帽','生存之帽','延续之帽','欲望之帽',}, },
[25] = {idx = 25,title = 'Archer',commoditys = {'精灵十字弩','精灵弓','誓言之弓','毁灭之弓','射手弩','射手弓','矛之战役弩','远古东方弓','暗杀者之弩','水晶弓','魔鬼骑士弓','阿克伦河弩','地狱守卫弩','十字天使翅弓',}, },
[26] = {idx = 26,title = 'Etc',commoditys = {'红宝石','金钢石','凯旋宝石','神圣宝石','超级凯旋宝石','德尔福罗斯宝石','幻想的凯旋宝石','赫尔梅德林',}, },

}

---@class kx_shops_data
local kx_shops_data =
{
	
---序号
idx = 0,
---标题
title = nil,
---出售的道具列表
commoditys = {},
}

local indexTable = 
{
	__index = function()
		return kx_shops_data
	end,
	__newindex = function (t,k,v)
		error('lua表格不允许修改！！' .. debug.traceback())
	end
}

setmetatable(_kx_shops_table, indexTable)

kx_shops_table = _kx_shops_table
return _kx_shops_table